# UIApplication Events

Source: https://www.revitapidocs.com/2026/f5d59bc1-bdcc-942e-2f72-02a86f1dbd00.htm

---

| UIApplication Events |
| --- |

The UIApplication type exposes the following members.

Events

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationClosing | Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed. |
|  | DialogBoxShowing | Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box. |
|  | DisplayingOptionsDialog | Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying. |
|  | DockableFrameFocusChanged | Subscribe to this event to be notified when a Revit GenericDockableFrame has gained focus or lost focus in the Revit user interface.  This event is called only for API\-created GenericDockableFrames. |
|  | DockableFrameVisibilityChanged | Subscribe to this event to be notified when a Revit GenericDockableFrame has been shown or hidden in the Revit user interface.  This event is called only for API\-created GenericDockableFrames. |
|  | FabricationPartBrowserChanged | Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated. |
|  | FormulaEditing | Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked. |
|  | Idling | Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction. |
|  | MacroUpdated | MacroUpdated. |
|  | SelectionChanged | Subscribe to the SelectionChanged event to be notified after the selection was changed. |
|  | ThemeChanged | Subscribe to the ThemeChanged event to be notified after the theme was changed. |
|  | TransferredProjectStandards | Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized. |
|  | TransferringProjectStandards | Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog. |
|  | ViewActivated | Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document. |
|  | ViewActivating | Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document. |

Top See Also

#### Reference

UIApplication Class Autodesk.Revit.UI Namespace